#include<stdio.h>

//
//                       _oo0oo_
//                      o8888888o
//                      88" . "88
//                      (| -_- |)
//                      0\  =  /0
//                    ___/`---'\___
//                  .' \\|     |// '.
//                 / \\|||  :  |||// \
//                / _||||| -:- |||||- \
//               |   | \\\  -  /// |   |
//               | \_|  ''\---/''  |_/ |
//               \  .-\__  '-'  ___/-. /
//             ___'. .'  /--.--\  `. .'___
//          ."" '<  `.___\_<|>_/___.' >' "".
//         | | :  `- \`.;`\ _ /`;.`/ - ` : | |
//         \  \ `_.   \_ __\ /__ _/   .-` /  /
//     =====`-.____`.___ \_____/___.-`___.-'=====
//                       `=---='
//
//
//     ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
//
//              佛祖保佑         永無BUG
//
//
//

int main(){
	FILE *input;
	input = fopen("input12.txt","r");
	
	char str[100][11];		 //儲存字串並編號
	char temp[11];			 //暫存字串用
	int unsortibility[100] = {0};  //排序度
		 int count = 0;		 //不確定有幾行輸入，上限設為100`,count之後代表行數

		 while (fgets(temp, 11, input) != NULL) {
         	 int i;
			 for(i = 0 ; i < 10 ; ++i)
			 	str[count][i] = temp[i];
			 ++count;

			 char t;				//處理換行字元
			 t = fgetc(input);

			 //printf(temp);printf("%d\n",count);
    	}

    	int i; //逐行計算未排序度
    	for(i = 0 ; i < count; ++i){
    		int x, y;
    		for(x = 0; x < 9 ; ++x){ //計算由str[0]~str[8]各位子的未排序度，由於str[9]為最後一個字元，故不需要向其右方的字元比較大小
    			for(y = x + 1 ; y < 10 ; ++y ){
    				if(str[i][y] < str[i][x])
    				++ unsortibility[i];
    			}
    		}
    	}

    	int sort[count]; //儲存排序順序的陣列
    	int j;
    		for(j = 0 ; j < count ; ++j){

    			int minvalue = 10000;
    			int min = 0;
    			for(i = 0 ; i < count ; ++i){
    				if(unsortibility[i] < minvalue){
    				min = i;
					minvalue = unsortibility[i];
					}

					if(i == count - 1)
    				unsortibility[min] = 10000;  // 找出當前未排序度最小值的編號並放置到sort陣列中，並將此編號排除出下一次最小值搜尋
    			}

    			sort[j] = min;
    		}

    	printf("Output:\n\n");
    	for(j = 0 ; j < count ; ++j){
			for(i = 0 ; i < 10 ; ++i)
    		printf("%c",str[sort[j]][i]);
    		printf("\n");
    	}
}

/*
                                 |~~~~~~~|
                                 |       |
                                 |       |
                                 |       |
                                 |       |
                                 |       |
      |~.\\\_\~~~~~~~~~~~~~~xx~~~         ~~~~~~~~~~~~~~~~~~~~~/_//;~|
      |  \  o \_         ,XXXXX),                         _..-~ o /  |
      |    ~~\  ~-.     XXXXX`)))),                 _.--~~   .-~~~   |
       ~~~~~~~`\   ~\~~~XXX' _/ ';))     |~~~~~~..-~     _.-~ ~~~~~~~
                `\   ~~--`_\~\, ;;;\)__.---.~~~      _.-~
                  ~-.       `:;;/;; \          _..-~~
                     ~-._      `''        /-~-~
                         `\              /  /
                           |         ,   | |
                            |  '        /  |
                             \/;          |
                              ;;          |
                              `;   .       |
                              |~~~-----.....|
                             | \             \
                            | /\~~--...__    |
                            (|  `\       __-\|
                            ||    \_   /~    |
                            |)     \~-'      |
                             |      | \      '
                             |      |  \    :
                              \     |  |    |
                               |    )  (    )
                                \  /;  /\  |
                                |    |/   |
                                |    |   |
                                 \  .'  ||
                                 |  |  | |
                                 (  | |  |
                                 |   \ \ |
                                 || o `.)|
                                 |`\\\\) |
                                 |       |
                                 |       |
    ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

                      耶穌保佑                永無 BUG
*/
